public class Main {
    public static void main(String[] args) {

    }
}
//Здравствуйте,по ТЗ есть вопросы.
//1. Нужно добавить два новых поля (duration и startTime) ,они должны быть только полями? В конструкторе их не должно быть?
//Потому что как я понял, могут быть задачи без времени и промежутка, тогда получается устанавливать значения и получать надо
//через гетеры и сетеры , а в конструктор передавать не нужно?
//2. По тестированию просят создать классы (TaskManagerTest<? extends TaskManager> и BaseTaskManager<? extends Task>.
// Если мы так создаем классы, то идея ругается. Не совсем понятно как это реализовать, смысл ясен, но реализовать
//не понятно (Реализацию TaskManagerTest<Е extends TaskManager> и BaseTaskManager<Е extends Task> принимает ,
// не совсем понятно ,чем они отличаются)
//И так же хочется узнать, как понимаю я тесты не совсем правильно реализую, лучше сравнивать по спискам (то есть
// например изменил задачу и вызвать список getAllTypeTask, getAllTask, getAllEpic, getAllSubTaskOfEpic)
// , а сейчас я сравниваю boolean что как кажется неверно.
